var data = [
	{
		"imgSrc": "https://show.ybccode.com/idiom/chengfengpolang.png",
		"options": ['破', '顺', '乘', '风', '械', '浪', '带', '脾', '并', '茅', '单', '吆', '艴', '番', '磬', '萼', '餗', '框', '剸', '嵓', '沮', '叶', '闰', '攧'],
		"pinYin": "chéng fēng pò làng",
		"explain": "船只乘着风势破浪前进。比喻排除困难，奋勇前进。",
		"source": "《宋书·宗悫传》：“悫年少时，炳问其志，悫曰：‘愿乘长风破万里浪。’”",
		"example": "轮船在乘风破浪，汽车在驶过原野。（茅盾《子夜》）",
		"answer": "乘风破浪"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/bairizuomeng.png",
		"options": ["惮", "鼷", "镊", "获", "鼪", "侈", "抒", "诗", "睚", "髊", "做", "楞", "闱", "梦", "交", "镬", "朗", "日", "瀑", "垓", "粤", "赳", "白", "稻"],
		"pinYin": "bái rì zuò mèng",
		"explain": "大白天做梦。比喻根本不能实现的梦想。",
		"source": "明·豫章醉月子《精选雅笑·送匾》：“以为必中而遍问星相者，亦是白日做梦。”",
		"example": "他不努力学习，却想得到好成绩，那纯属白日做梦。",
		"answer": "白日做梦"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/bailitiaoyi.png",
		"options": ["婀", "百", "埒", "谿", "睩", "勖", "魑", "竦", "战", "我", "栈", "肮", "秀", "箓", "醎", "一", "秣", "怠", "里", "挑", "梧", "岭", "裋", "侪"],
		"pinYin": "bǎi lǐ tiāo yī",
		"explain": "一百个当中就挑出这一个来。形容人才出众。",
		"source": "清·曹雪芹《红楼梦》第一百二十回：“姑爷年纪略大几岁，并没有娶过的，况且人物儿长的是百里挑一的。”",
		"example": "对报名参军的人挑选很严格，可以说是百里挑一。",
		"answer": "百里挑一"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/bamiaozhuzhang.png",
		"options": ["据", "啧", "助", "剁", "楔", "坂", "翦", "披", "老", "长", "镬", "惓", "迹", "苗", "拔", "荏", "俐", "唠", "捩", "香", "钜", "搴", "港", "胆"],
		"pinYin": "bá miáo zhù zhǎng",
		"explain": "比喻违反事物发展的客观规律，急于求成，反而坏事。",
		"source": "《孟子·公孙丑上》：“宋人有闵其苗之不长而揠之者，茫茫然归，谓其人曰：‘今日病矣，予助苗长矣。’其子趋而往视之，苗则槁矣。”",
		"example": "那种不顾学生能否接受的填鸭式的教学方法，无异于拔苗助长。",
		"answer": "拔苗助长"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/banbijiangshan.png",
		"options": ["莛", "山", "繇", "髀", "蝼", "踏", "读", "壁", "殪", "九", "瓣", "峻", "签", "半", "厦", "江", "柚", "辜", "叉", "啜", "殿", "捰", "频", "嬴"],
		"pinYin": "bàn bì jiāng shān",
		"explain": "半壁：半边；江山：比喻国家疆土。指在敌人入侵后残存或丧失的部分国土。",
		"source": "清·蒋士诠《冬青树·提纲》：“半壁江山，比五季朝廷尤小。”",
		"example": "文天祥辗转回到永嘉，面对南宋王朝的半壁江山，心中感慨万千。",
		"answer": "半壁江山"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/baotoushucuan.png",
		"options": ["癫", "砖", "烝", "獠", "男", "疽", "筌", "军", "弊", "遒", "突", "珥", "嗽", "莋", "鼠", "抱", "汰", "蜗", "魁", "头", "余", "窜", "很", "洞"],
		"pinYin": "bào tóu shǔ cuàn",
		"explain": "抱着头，象老鼠那样惊慌逃跑。形容受到打击后狼狈逃跑。",
		"source": "《汉书·蒯通传》：“始常山王、成安君故相与为刎颈之交，及争张黡、陈释之事，常山王奉头鼠窜，以归汉王。”",
		"example": "夫陆贾天下之辨士，吾前日遣之，智穷辞屈，抱头鼠窜，颠狈而归。（宋·苏轼《拟侯公说项羽辞》）",
		"answer": "抱头鼠窜"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/beijinglixiang.png",
		"options": ["背", "磔", "叵", "墙", "强", "井", "僶", "节", "戒", "酗", "伞", "婑", "乡", "陪", "阱", "离", "钓", "垛", "割", "靴", "歇", "骋", "病", "至"],
		"pinYin": "bèi jǐng lí xiāng",
		"explain": "离开家乡到外地。",
		"source": "元·贾仲名《对玉梳》第一折：“送的他离乡背井，进退无门。",
		"example": "背井离乡，卧雪眠霜。（元·马致远《汉宫秋》第三折）",
		"answer": "背井离乡"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/biaoliruyi.png",
		"options": ["殻", "札", "熯", "靥", "如", "锈", "箫", "表", "恍", "薙", "擩", "忽", "斜", "郞", "埳", "臾", "一", "里", "河", "玉", "转", "蹴", "恡", "尝"],
		"pinYin": "biǎo lǐ rú yī",
		"explain": "表：外表；里：内心。表面和内心象一个东西。形容言行和思想完全一致。",
		"source": "《朱子全书·论语》：“行之以忠者，是事事要着实，故某集注云：‘以忠，则表里如一。’”",
		"example": "我言行一致，表里如一。（郭沫若《屈原》第四幕）",
		"answer": "表里如一"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/bimensiguo.png",
		"options": ["思", "傜", "刺", "筵", "缘", "巾", "店", "过", "茞", "躞", "於", "绅", "贳", "刷", "虱", "门", "费", "卻", "掩", "闭", "箧", "挤", "奖", "史"],
		"pinYin": "bì mén sī guò",
		"explain": "过：过失。关起门来反省。",
		"source": "《汉书·韩延寿传》：“因入卧传舍，闭閤思过。”三国蜀·诸葛亮《黜来敏教》：“自谓能敦厉薄俗，帅之以义。今既不能，表退职，使闭门思愆。”",
		"example": "小仙自知身获重罪，追悔莫及，惟有闭门思过，敬听天命。（清·李汝珍《镜花缘》第六回）",
		"answer": "闭门思过"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/binglinchengxia.png",
		"options": ["迄", "少", "形", "破", "潠", "致", "飱", "诘", "奈", "临", "蚕", "燎", "兵", "杓", "考", "下", "瓶", "鞠", "瘗", "蜜", "城", "趣", "逝", "境"],
		"pinYin": "bīng lín chéng xià",
		"explain": "敌军已来到自己的城墙下面。比喻情势十分危急。",
		"source": "元·无名氏《 范书》第一折：“有一日兵临城下，将至濠边，四下里安环，八下里拽炮，人平了你宅舍，马践了你庭堂。”",
		"example": "若侯兵临城下，将至壕边，然后拒敌，事已迟矣。（明·罗贯中《三国演义》第三十一回）",
		"answer": "兵临城下"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/caigaobadou.png",
		"options": ["耋", "雉", "涂", "汶", "犊", "踧", "纱", "雷", "蹄", "撧", "刷", "斗", "皲", "审", "鹂", "电", "才", "滂", "高", "蠭", "八", "侧", "记", "异"],
		"pinYin": "cái gāo bā dǒu",
		"explain": "比喻人极有才华。",
		"source": "《南史·谢灵运传》：“天下才共一石，曹子建独得八斗，我得一斗，自古及今共用一斗。”",
		"example": "左宗棠这人虽然才高八斗，器量却不开阔。（唐浩明《曾国潘》）",
		"answer": "才高八斗"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/cencibuqi.png",
		"options": ["犂", "郞", "列", "浸", "压", "鹗", "铊", "题", "麕", "脯", "螳", "差", "患", "厉", "哥", "魀", "辅", "不", "参", "播", "鳬", "齐", "摩", "冗"],
		"pinYin": "cēn cī bù qí",
		"explain": "长短、高低不齐。形容水平不一或很不整齐。",
		"source": "《诗经·周南·关雎》：“参差荇菜，左右采之。”《汉书·扬雄传下》：“仲尼以来，国君将相卿士名臣参差不齐，一概诸圣。”",
		"example": "这些树很久没有修剪了，长得高高低低，参差不齐。",
		"answer": "参差不齐"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/chilipawai.png",
		"options": ["外", "焕", "淄", "搡", "芹", "烟", "悯", "则", "画", "皁", "港", "噫", "臣", "汝", "圃", "御", "蕉", "扒", "帘", "捕", "餞", "吃", "里", "獠"],
		"pinYin": "chī lǐ pá wài",
		"explain": "接受这一方面的好处，却为那一方面卖力。也指将自己方面的情况告诉对方。",
		"source": "周立波《暴风骤雨》第一部六：“人心隔肚皮，备不住有那吃里扒外的家伙走风漏水，叫韩老六跑了。”",
		"example": "无",
		"answer": "吃里扒外"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/choumeikulian.png",
		"options": ["樵", "眉", "讥", "竟", "谚", "桴", "拘", "虻", "胔", "建", "菇", "愁", "遄", "揆", "苦", "侍", "呵", "驽", "纤", "脸", "螫", "谹", "操", "沸"],
		"pinYin": "chóu méi kǔ liǎn",
		"explain": "皱着眉头，哭丧着脸。形容愁苦的神色。",
		"source": "元·王实甫《西厢记》第三本第二折：“对人前巧语花言，背地里愁眉泪脸。”",
		"example": "成老爹气得愁眉苦脸，只得自己走出去回那几个乡里人去了。（清·吴敬梓《儒林外史》第四十八回）",
		"answer": "愁眉苦脸"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/chukouchengzhang.png",
		"options": ["壁", "章", "施", "膑", "稗", "蚓", "犀", "孅", "撙", "驷", "韵", "成", "輗", "出", "佔", "適", "他", "朦", "白", "枪", "口", "嫣", "标", "袜"],
		"pinYin": "chū kǒu chéng zhāng",
		"explain": "说出话来就成文章。形容文思敏捷，口才好。",
		"source": "《诗经·小雅·都人士》：“彼都人士，狐裘黄黄，其容不改，出言成章。”",
		"example": "人皆言子建出口成章，臣未深信。主上可召入，以才试之。（明·罗贯中《三国演义》第七十九回）",
		"answer": "出口成章"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/dacaixiaoyong.png",
		"options": ["暇", "大", "烬", "鬐", "贡", "妄", "材", "该", "操", "藤", "副", "儿", "壳", "用", "小", "轾", "缨", "鉴", "攘", "臡", "头", "俯", "鹦", "段"],
		"pinYin": "dà cái xiǎo yòng",
		"explain": "把大的材料当成小的材料用。比喻使用不当，浪费人才。",
		"source": "《后汉书·边让传》：“此言大器之于小用，固有所不宜也。”",
		"example": "大材小用古所叹，管仲萧何实流业。（宋·陆游《送辛幼安殿撰造朝》诗）",
		"answer": "大材小用"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/dacaojingshe.png",
		"options": ["草", "黔", "魃", "糊", "赅", "矜", "蛇", "雾", "落", "码", "撕", "查", "爷", "版", "镴", "惊", "唐", "摛", "打", "遨", "佞", "毁", "佚", "歙"],
		"pinYin": "dǎ cǎo jīng shé",
		"explain": "原比喻惩甲菟乙。后多比喻做法不谨慎，反使对方有所戒备。",
		"source": "明·郎瑛《七修类稿》卷二十四：“打草惊蛇，乃南唐王鲁为当涂令，日营资产，部人诉主簿贪污，鲁曰：‘汝虽打草，吾已惊蛇。’”",
		"example": "空自去“打草惊蛇”，倒吃他做了手脚，却是不好。（明·施耐庵《水浒全传》第二十九回）",
		"answer": "打草惊蛇"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/dandabaotian.png",
		"options": ["胆", "天", "傜", "出", "期", "粉", "妈", "耜", "招", "边", "溜", "包", "刽", "鲸", "丑", "大", "辫", "咐", "柙", "郐", "麟", "媿", "锣", "郑"],
		"pinYin": "dǎn dà bāo tiān",
		"explain": "形容胆子极大。",
		"source": "唐 刘叉《自问》：“自问彭城子何人授汝颠，酒肠宽似海，诗胆大于天。”",
		"example": "这个胆大包天的盗贼终于落入了法网。",
		"answer": "胆大包天"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/danjinliangjue.png",
		"options": ["瑟", "玉", "弹", "粮", "缙", "俳", "迸", "失", "岛", "尽", "很", "郢", "昙", "蛔", "绝", "邺", "啪", "苡", "终", "囫", "啻", "虚", "捰", "船"],
		"pinYin": "dàn jìn liáng jué",
		"explain": "作战中弹药用完了，粮食也断绝了。指无法继续作战的危险处境。",
		"source": "宋·杨万里《钤辖赵公墓志铭》：“公挺身与兵，屡捷。七年，粮尽援绝，势不能复支，遂率所部数千人南归。”",
		"example": "东北抗联八位女战士掩护主力，阻击日寇，最后弹尽粮绝，投江壮烈牺牲。",
		"answer": "弹尽粮绝"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/daxianshenshou.png",
		"options": ["噼", "嵘", "鈇", "戢", "踡", "慰", "歳", "汜", "款", "笥", "讪", "手", "珮", "大", "捱", "夷", "魂", "显", "聱", "越", "身", "更", "来", "葭"],
		"pinYin": "dà xiǎn shēn shǒu",
		"explain": "显：表露，表现；身手：指本领。充分显示出本领和才能。",
		"source": "赵树理《三里湾》七：“这两个人默默不语在这座房子里大显身手。”",
		"example": "爱唱的人，就在舞台上痛痛快快唱吧！爱种棉花的，就在连成片的土地上大显身手吧！（茹志娟《高高的白杨树》）",
		"answer": "大显身手"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/degaowangzhong.png",
		"options": ["扒", "德", "录", "霾", "矻", "瘗", "望", "璧", "闪", "簵", "重", "妒", "廪", "妣", "高", "幸", "奉", "洒", "廷", "搭", "过", "劾", "愉", "豨"],
		"pinYin": "dé gāo wàng zhòng",
		"explain": "德：品德；望：声望。道德高尚，名望很大。",
		"source": "《晋书·简文三子传》：“元显因讽礼官下仪，称已德隆望重，既录百揆，内外群僚皆应尽敬。”",
		"example": "龚师傅德高望重，既有主张，自然力量不小。（《续孽海花》第四十回）",
		"answer": "德高望重"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/diguagnrenxi.png",
		"options": ["福", "惴", "逊", "汗", "斫", "搭", "絫", "荡", "人", "沉", "劲", "憎", "秾", "贡", "稀", "感", "拜", "旌", "广", "桡", "见", "仔", "地", "薰"],
		"pinYin": "dì guǎng rén xī",
		"explain": "地方大，人烟少。",
		"source": "《汉书·地理志下》：“习俗颇殊，地广民稀。”",
		"example": "奈缘地广人稀，首尾不能救应。（明·施耐庵《水浒全传》第八十三回）",
		"answer": "地广人稀"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/dingtianlidi.png",
		"options": ["天", "珪", "顶", "宾", "覉", "捞", "讬", "铺", "蹰", "溪", "煨", "熔", "实", "营", "拖", "荜", "跎", "跻", "媳", "地", "立", "蓦", "钿", "塘"],
		"pinYin": "dǐng tiān lì dì",
		"explain": "头顶云天，脚踏大地。形容形象高大，气慨豪迈。",
		"source": "宋·释惟白《续传灯录·安吉州道场无庵法全禅师》：“汝等诸人，个个顶天立地……更来这里觅个甚么？”元·纪君祥《赵氏孤儿》第一折：“我韩厥是一个顶天立地的男儿。”",
		"example": "先生是楚国的栋梁，是顶天立地的柱石。（郭沫若《屈原》第三幕）",
		"answer": "顶天立地"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/diusanlasi.png",
		"options": ["聋", "迥", "慝", "迴", "落", "四", "诩", "欣", "櫜", "皷", "霸", "瞬", "畎", "肮", "丢", "驹", "庙", "格", "幞", "棒", "橐", "膜", "衢", "三"],
		"pinYin": "diū sān là sì",
		"explain": "形容做事马虎粗心，不是丢了这个，就是忘了那个。",
		"source": "清·曹雪芹《红楼梦》第六十七回：“咱们家没人，俗语说的‘夯雀儿先飞’，省的临时丢三落四的不齐全，令人笑话。”",
		"example": "老年人记忆力衰退，做事常常丢三落四，年轻人应体谅。",
		"answer": "丢三落四"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/dongzhangxiwang.png",
		"options": ["樗", "迷", "蝼", "娟", "东", "望", "森", "誉", "聆", "煎", "沱", "债", "西", "宕", "翠", "昂", "游", "张", "濒", "置", "啰", "远", "漆", "窾"],
		"pinYin": "dōng zhāng xī wàng",
		"explain": "张：看。形容这里那里地到处看。",
		"source": "明·冯梦龙《古今小说》卷一：“三巧儿只为信了卖卦先生之语，一心只想丈夫回来，从此时常走向前楼，在帘内东张西望。”",
		"example": "见范进抱着鸡，手里插个草标，一步一踱的，东张西望，在那里寻人买。（清·吴敬梓《儒林外史》第三回）",
		"answer": "东张西望"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/dudangyimian.png",
		"options": ["颭", "墐", "骇", "气", "当", "兴", "缶", "祝", "许", "面", "囿", "谟", "姊", "闇", "一", "独", "癃", "否", "拿", "秕", "八", "奸", "允", "梗"],
		"pinYin": "dú dāng yī miàn",
		"explain": "单独负责一个方面的工作。",
		"source": "《史记·留侯世家》：“而汉王之将，独韩信可属大事，当一面。”",
		"example": "将来可以独当一面，只嫌功名心重些。（清·曾朴《孽海花》第四回）",
		"answer": "独当一面"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/duiniutanqin.png",
		"options": ["琳", "喟", "拓", "芍", "对", "牛", "遢", "辂", "召", "隗", "琴", "么", "浊", "愁", "弹", "蔑", "痿", "凡", "锥", "缁", "彻", "限", "俚", "牵"],
		"pinYin": "duì niú tán qín",
		"explain": "讥笑听话的人不懂对方说得是什么。用以讥笑说话的人不看对象。",
		"source": "汉·牟融《理惑论》：“公明仪为牛弹清角之操，伏食如枚。非牛不闻，不合其耳矣。”",
		"example": "对牛弹琴，牛不入耳，骂得很好，咱们一总再算账！（清·李当珍《镜花缘》第九十回）",
		"answer": "对牛弹琴"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/durirunian.png",
		"options": ["筴", "髫", "莫", "如", "克", "蠒", "跛", "罅", "年", "篱", "报", "缮", "夺", "赀", "轼", "咸", "羖", "掩", "畜", "沦", "度", "贞", "日", "舂"],
		"pinYin": "dù rì rú nián",
		"explain": "过一天象过一年那样长。形容日子很不好过。",
		"source": "宋·柳永《戚氏》：“孤馆度日如年。”",
		"example": "感承众头领好意相留，只是小可度日如年，今日告辞。（明·施耐庵《水浒全传》第六十二回）",
		"answer": "度日如年"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/enzhongrushan.png",
		"options": ["山", "驺", "击", "部", "撦", "兴", "非", "芷", "罪", "箝", "孳", "重", "特", "嗥", "墐", "残", "咒", "恩", "如", "寮", "填", "浡", "战", "踣"],
		"pinYin": "ēn zhòng rú shān",
		"explain": "恩情深厚，像山一样深重。",
		"source": "宋·陆游《删定官供职谢启》：“拔茅以征，冒处清流之末；及瓜雨往，曾无累月之淹。恩重如山，感深至骨。”",
		"example": "他冒着生命危险把我从死亡线上救过来，对我真是恩重如山。",
		"answer": "恩重如山"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/fengherili.png",
		"options": ["畎", "日", "迥", "风", "瞬", "皷", "巡", "彻", "衢", "殴", "慝", "阳", "嫂", "寒", "丽", "等", "欣", "乍", "和", "霸", "负", "庙", "櫜", "膜"],
		"pinYin": "fēng hé rì lì",
		"explain": "和风习习，阳光灿烂。形容晴朗暖和的天气。",
		"source": "清·吴趼人《痛史》：“是日风和日丽，众多官员，都来祭奠。”",
		"example": "是时风和日丽，遍地金黄，青衫红袖，越阡度陌，蝶蜂乱飞，令人不饮自醉。（清·沈复《浮生六记》卷二）",
		"answer": "风和日丽"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/fengyujiaojia.png",
		"options": ["擐", "辉", "袋", "细", "度", "瀽", "交", "鲜", "馋", "殺", "黩", "和", "释", "镕", "加", "谋", "睛", "冀", "雨", "风", "悸", "柰", "灭", "饰"],
		"pinYin": "fēng yǔ jiāo jiā",
		"explain": "又是刮风，又是下雨。比喻几种灾难同时袭来。",
		"source": "清 梁章钜《浪迹续谈 除夕元旦两诗》：“冬至前后，则连日阴噎，风雨交加，逾月不止。”",
		"example": "难以想象，他是怎样渡过那风雨交加的日子的。",
		"answer": "风雨交加"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/ganbaixiafeng.png",
		"options": ["甲", "俗", "荠", "入", "躐", "骼", "骜", "衰", "赜", "虀", "风", "拜", "俛", "恼", "湛", "蝉", "特", "下", "瀣", "甘", "睫", "回", "碻", "岁"],
		"pinYin": "gān bài xià fēng",
		"explain": "表示真心佩服，自认不如。",
		"source": "清·李汝珍《镜花缘》：“如此议论，才见读书人自有卓见，真是家学渊源，妹子甘拜下风。”",
		"example": "君神人也，吾等甘拜下风矣。★清·和邦额《夜谭随录·三官保》",
		"answer": "甘拜下风"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/gaoshanliushui.png",
		"options": ["貍", "宝", "椿", "亹", "鸦", "穑", "水", "蝎", "琯", "兴", "忭", "会", "浣", "葭", "珎", "猊", "纚", "按", "僻", "餧", "流", "高", "遗", "山"],
		"pinYin": "gāo shān liú shuǐ",
		"explain": "比喻知己或知音。也比喻乐曲高妙。",
		"source": "《列子·汤问》：“伯牙鼓琴，志在登高山，钟子期曰：‘善哉，峨峨兮若泰山。’志在流水，曰：‘善哉，洋洋兮若江河。’”",
		"example": "孔圣人尚学琴于师襄，一操便知其为文王。高山流水，得遇知音。（清·曹雪芹《红楼梦》第八十六回）",
		"answer": "高山流水"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/guixinsijian.png",
		"options": ["姬", "害", "聆", "郢", "诩", "殄", "山", "架", "锦", "探", "庀", "捭", "归", "愉", "似", "心", "浞", "主", "盘", "蔺", "箭", "秤", "劾", "雪"],
		"pinYin": "guī xīn sì jiàn",
		"explain": "想回家的心情象射出的箭一样快。形容回家心切。",
		"source": "清·陈忱《水浒后传》第十三回：“卢师越离家已久，归心如箭，恐怕淹留，连忙催促安道全作别。”",
		"example": "不多时，穿过松林，渡过小溪，过了水月村，越过镜花岭，真是归心似箭。（清·李汝珍《镜花缘》第二十一回）",
		"answer": "归心似箭"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/hengchongzhizhuang.png",
		"options": ["忸", "喋", "呻", "嗣", "乘", "撞", "阪", "臻", "冲", "栋", "夜", "癃", "辕", "胧", "直", "恃", "麽", "和", "枷", "横", "愦", "斵", "携", "斌"],
		"pinYin": "héng chōng zhí zhuàng",
		"explain": "乱冲乱撞，蛮横无理。",
		"source": "明·李贽《续焚书·与友人论文》：“凡作文皆从外边攻进里去，我谓文章就时而攻打出来，就他城池，食他粮草，统率他兵马，直冲横撞，搅得他粉碎，故不费一毫气力而自然有余也。”",
		"example": "只见三妖全身甲胄，横冲直撞，左右厮杀。（明·许仲琳《封神演义》第九十六回）",
		"answer": "横冲直撞"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/hualongdianjing.png",
		"options": ["撩", "粘", "版", "寻", "龙", "迎", "礁", "掘", "睛", "泼", "雨", "揽", "茨", "洞", "扯", "张", "画", "辟", "尉", "监", "堆", "殆", "嗤", "点"],
		"pinYin": "huà lóng diǎn jīng",
		"explain": "原形容梁代画家张僧繇作画的神妙。后多比喻写文章或讲话时，在关键处用几句话点明实质，使内容生动有力。",
		"source": "唐·张彦远《历代名画记·张僧繇》：“金陵安乐寺四白龙不点眼睛，每云：‘点睛即飞去。’人以为妄诞，固请点之。须臾，雷电破壁，两龙乘云腾去上天，二龙未点眼者见在。”",
		"example": "这然而一个好题目，却常常对作品有画龙点睛之妙，激发人们阅读的兴趣。（秦牧《车窗文学欣赏》）",
		"answer": "画龙点睛"
	}, 
	{
		"imgSrc": "https://show.ybccode.com/idiom/huashetianzu.png",
		"options": ["汞", "礴", "画", "足", "喳", "詟", "盾", "浩", "贴", "枣", "尋", "止", "舔", "性", "匀", "酝", "劚", "便", "蛇", "腾", "纯", "上", "撑", "添"],
		"pinYin": "huà shé tiān zú",
		"explain": "画蛇时给蛇添上脚。比喻做了多余的事，非但无益，反而不合适。",
		"source": "《战国策·齐策二》：“蛇固无足，子安能，而外学其文，虽有贤师良友，若画脂镂冰，费日损功。”",
		"example": "将军功绩已成，威声大震，可以止矣。今若前进，倘不如意，正如“画蛇添足”也。（明·施耐庵《水浒全传》第一百十回）",
		"answer": "画蛇添足"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/hutoushewei.png",
		"options": ["桃", "铆", "龈", "真", "详", "蛇", "虎", "妪", "蹉", "女", "辐", "江", "迈", "眇", "痺", "寻", "揪", "尾", "雀", "震", "殷", "擘", "薏", "头"],
		"pinYin": "hǔ tóu shé wěi",
		"explain": "头大如虎，尾细如蛇。比喻开始时声势很大，到后来劲头很小，有始无终。",
		"source": "元·康进之《李逵负棘》第二折：“则为你两头白面搬兴废，转背言词说是非，这厮敢狗行狼心，虎头蛇尾。”",
		"example": "小奇也许会写得好，就是她有一个毛病，“虎头蛇尾”。（冰心《陶奇的星期日记》）",
		"answer": "虎头蛇尾"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/jiangxinbixin.png",
		"options": ["髯", "苏", "永", "鲂", "盹", "蛰", "咷", "讹", "娱", "撙", "袷", "命", "擎", "心", "润", "瞠", "企", "土", "心", "滕", "顶", "比", "将", "畋"],
		"pinYin": "jiāng xīn bǐ xīn",
		"explain": "设身处地地为别人着想。",
		"source": "明·汤显祖《紫钗记》第三十八出：“太尉不将心比心，小子待将计就计。”",
		"example": "我也有子女，将心比心，我理解家长们希望孩子升入重点中学或重点大学的愿望和心情。",
		"answer": "将心比心"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/jiatusibi.png",
		"options": ["趄", "斓", "壁", "凶", "奕", "顾", "家", "盔", "啮", "鞘", "貤", "菊", "痼", "逃", "奉", "慄", "屦", "脩", "敩", "四", "珰", "粝", "圈", "徒"],
		"pinYin": "jiā tú sì bì",
		"explain": "家里只有四面的墙壁。形容十分贫困，一无所有。",
		"source": "《汉书·司马相如传上》：“文君夜亡奔相如，相如与驰归成都，家徒四壁立。”",
		"example": "他已穷到家徒四壁，身无分文的地步了。",
		"answer": "家徒四壁"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/jieerliansan.png",
		"options": ["三", "姜", "连", "痌", "痼", "书", "篪", "捷", "接", "破", "估", "棘", "薰", "恕", "漾", "二", "鴃", "簿", "蔬", "肱", "囫", "供", "课", "疗"],
		"pinYin": "jiē èr lián sān",
		"explain": "接连不断。",
		"source": "于是接二连三，牵五挂四，将一条街烧得如‘火焰山’一般。  清·曹雪芹《红楼梦》第一回",
		"example": "于是接二连三，牵五挂四，将一条街烧得如“火焰山”一般。（清·曹雪芹《红楼梦》第一回）",
		"answer": "接二连三"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/jifeigoutiao.png",
		"options": ["抗", "笄", "飞", "厌", "姗", "捣", "堰", "渲", "鸡", "习", "狗", "法", "跳", "笫", "咨", "癕", "媠", "亥", "贺", "齰", "词", "羯", "镂", "僄"],
		"pinYin": "jī fēi gǒu tiào",
		"explain": "把鸡吓得飞起来，把狗吓得到处乱跳。形容惊慌得乱成一团。",
		"source": "茅盾《锻炼》：“然而陈克明却在这里想象，一方面疑神疑鬼，又一方面畏惧怨恨所造成的鸡飞狗跳、人人自危的情形。”",
		"example": "无",
		"answer": "鸡飞狗跳"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/jingdizhiwa.png",
		"options": ["匐", "阄", "绵", "滋", "缰", "最", "先", "肮", "胞", "酰", "蓼", "撦", "井", "拜", "谶", "蛙", "裎", "瑶", "之", "责", "呰", "魄", "底", "守"],
		"pinYin": "jǐng dǐ zhī wā",
		"explain": "井底的蛙只能看到井口那么大的一块天。比喻见识狭窄的人。",
		"source": "《庄子·秋水》：“井蛙不可以语于海者，拘于虚也。”",
		"example": "井底之蛙，所见不大；萤火之光，其亮不远。（明·许仲琳《封神演义》第二十五回）",
		"answer": "井底之蛙"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/jinjiduli.png",
		"options": ["属", "飏", "辩", "鲜", "噬", "磷", "资", "十", "金", "杓", "惙", "独", "双", "戤", "薙", "孤", "勋", "炎", "背", "野", "鸡", "立", "易", "礉"],
		"pinYin": "jīn jī dú lì",
		"explain": "指独腿站立的一种武术姿势。后也指用一足站立。",
		"source": "清·李汝珍《镜花缘》第七十四回：“我是‘金鸡独立’，要一足微长。”",
		"example": "你站在这桌子上，金鸡独立，那一条腿不许放下来。（茅盾《子夜》十七）",
		"answer": "金鸡独立"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/jiuniuyimao.png",
		"options": ["九", "静", "棠", "率", "墙", "一", "澎", "赌", "鸲", "褊", "贾", "鞅", "斯", "牛", "生", "瘅", "插", "囷", "毛", "童", "鸳", "胙", "三", "帢"],
		"pinYin": "jiǔ niú yī máo",
		"explain": "九条牛身上的一根毛。比喻极大数量中极微小的数量，微不足道。",
		"source": "汉·司马迁《报任少卿书》：“假令仆伏法受诛，若九牛亡一毛，与蝼蚁何以异？”",
		"example": "九牛一毫莫自夸，骄傲自满必翻车。（陈毅《感事书怀·七古·手莫伸》诗）",
		"answer": "九牛一毛"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/juechuchongsheng.png",
		"options": ["酲", "处", "覩", "总", "飜", "缉", "绝", "琏", "逢", "诐", "蟠", "蚁", "蓉", "叡", "欣", "翰", "生", "姑", "拘", "挝", "憰", "楣", "嚎", "邺"],
		"pinYin": "jué chù féng shēng",
		"explain": "形容在最危险的时候得到生路。",
		"source": "元·关汉卿《钱大尹知勘绯衣梦·正名》：“李庆安绝处幸逢生。”",
		"example": "常言“吉人天相，绝处逢生。”（明·冯梦龙《警世通言·桂员外途穷忏悔》）",
		"answer": "绝处逢生"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/kuarizhuifu.png",
		"options": ["后", "鹣", "软", "蛱", "夸", "厕", "追", "日", "椽", "吠", "哕", "脔", "磷", "篑", "庖", "炼", "父", "囔", "牧", "白", "蚌", "说", "蔼", "台"],
		"pinYin": "kuā fù zhuī rì",
		"explain": "古代神话。同“夸父逐日”。",
		"source": "毛泽东《矛盾论》：“神话中的许多变化，例如《山海经》中所说的‘夸父追日’……这种神话中所说的矛盾的互相变化，乃是无数复杂的现实矛盾的互相变化对于人们所引起的一种幼稚的、想象的、主观幻想的变化……”",
		"example": "无",
		"answer": "夸父追日"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/kuxiaobude.png",
		"options": ["帢", "得", "哭", "納", "召", "张", "屦", "笑", "盱", "调", "缟", "夹", "鹗", "鲋", "梁", "垦", "福", "不", "不", "誉", "搤", "茫", "蚩", "恬"],
		"pinYin": "kū xiào bù dé",
		"explain": "哭也不好，笑也不好。形容很尴尬。",
		"source": "元·高安得《皮匠说谎》：“好一场恶一场，哭不得笑不得。”",
		"example": "否则咬着了辣椒，哭笑不得的时候，我不能负责。（鲁迅《伪自由书·止哭文学》）",
		"answer": "哭笑不得"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/langbeiweijian.png",
		"options": ["下", "齧", "狼", "鸽", "狈", "狂", "恬", "堂", "寝", "幕", "逾", "为", "崟", "莱", "缓", "校", "懵", "敩", "奸", "肢", "泄", "兕", "哕", "内"],
		"pinYin": "láng bèi wéi jiān",
		"explain": "比喻互相勾结干坏事。",
		"source": "故世言事乖者称狼狈。  唐·段成式《酉阳杂俎》十六",
		"example": "帝国主义与封建势力永远是互相勾结，狼狈为奸的。（闻一多《谨防汉奸合法化》）",
		"answer": "狼狈为奸"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/lanyuchongshu.png",
		"options": ["孅", "嫣", "觌", "滥", "惇", "輗", "闷", "实", "驷", "犀", "撙", "浩", "蒭", "膑", "蚓", "诲", "竽", "施", "摅", "佔", "数", "岸", "適", "充"],
		"pinYin": "làn yú chōng shù",
		"explain": "比喻无本领的冒充有本领，次货冒充好货。",
		"source": "《韩非子·内储说上》：“齐宣王使人吹竽，必三百人。南郭处士请为王吹竽，宣王说之，廪食以数百人。宣王死，湣王立，好一一听之，处士逃。”",
		"example": "言调整人事，滥竽充数，依然如故。（邹韬奋《抗战以来》）",
		"answer": "滥竽充数"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/liangxiangqingyuan.png",
		"options": ["涕", "可", "惑", "挹", "两", "西", "隙", "缠", "亡", "匏", "唉", "勖", "槃", "情", "咧", "滩", "钉", "愿", "飐", "琢", "抬", "啾", "胸", "厢"],
		"pinYin": "liǎng xiāng qíng yuàn",
		"explain": "两厢：双方；情愿：心里愿意。两方都愿意；互不勉强。也作“两相情愿”。",
		"source": "明·施耐庵《水浒》：“智深大笑道：‘太公；你也是个痴汉；既然不两厢情愿；如何招赘做个女婿？’”",
		"example": "因为当初是两厢情愿的，所以遇到困难也能商量着解决，谁也不埋怨谁。",
		"answer": "两厢情愿"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/liganjianying.png",
		"options": ["魉", "嫁", "穷", "汗", "门", "托", "池", "饰", "户", "螂", "捉", "立", "竿", "转", "见", "喷", "恶", "岛", "鹓", "拼", "遄", "遐", "影", "衽"],
		"pinYin": "lì gān jiàn yǐng",
		"explain": "在阳光下把竿子竖起来，立刻就看到影子。比喻立刻见到功效。",
		"source": "汉·魏伯阳《参同契》卷下：“立竿见影，呼谷传响。”",
		"example": "你说你莲花化身，清净无为，其如五行变化，立竿见影。（明·许仲琳《封神演义》第七十八回）",
		"answer": "立竿见影"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/liuanhuaming.png",
		"options": ["騃", "谠", "牺", "瘠", "崎", "啸", "龠", "明", "跳", "腴", "松", "瞚", "呆", "柳", "爹", "淳", "磅", "娑", "暗", "圭", "荡", "为", "花", "现"],
		"pinYin": "liǔ àn huā míng",
		"explain": "垂柳浓密，鲜花夺目。形容柳树成荫，繁花似锦的春天景象。也比喻在困难中遇到转机。",
		"source": "唐·武元衡《摩河池送李侍御之凤翔》：“柳暗花明池上山，高楼歌洒换离颜。”宋·陆游《游山西村》诗：“山重水复疑无路，柳暗花明又一村。”",
		"example": "十二月十三日之晨，我心酸肠断，以为从此要尝些人生失望与悲哀的滋味，谁知眼前有这种柳暗花明的美景。（冰心《寄小读者·通讯十一》）",
		"answer": "柳暗花明"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/liyingwaihe.png",
		"options": ["叶", "藉", "跬", "觌", "合", "损", "殒", "外", "蠹", "秣", "埜", "客", "凿", "齑", "壕", "魁", "个", "孱", "应", "辈", "伞", "眄", "里", "饰"],
		"pinYin": "lǐ yīng wài hé",
		"explain": "应：接应；合：配合。外面攻打，里面接应。",
		"source": "元·杨梓《豫让吞炭》第三折：“反被韩，魏同谋，里应外合，决水淹我军，甲士溃乱，死者山积。”",
		"example": "过几日，我这里差人去投降，他们必然懈怠，我们却去劫寨，那时里应外合，定获全胜。（清·陈忱《水浒后传》第十七回）",
		"answer": "里应外合"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/madaochenggong.png",
		"options": ["雄", "到", "铊", "功", "癫", "碗", "搏", "冁", "魅", "诞", "梅", "成", "装", "块", "闼", "马", "跃", "深", "宝", "盖", "疯", "绿", "澥", "娜"],
		"pinYin": "mǎ dào chéng gōng",
		"explain": "形容工作刚开始就取得成功。",
		"source": "元·无名氏《小尉迟》第二折：“那老尉迟这一去，马到成功。”",
		"example": "只要不轻敌，相信你们一定会马到成功。",
		"answer": "马到成功"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/maiduhuanzhu.png",
		"options": ["酢", "寰", "虢", "趔", "汜", "珠", "菱", "肤", "涟", "杷", "还", "粗", "霏", "凉", "脆", "打", "茕", "椟", "口", "欿", "缝", "买", "姿", "类"],
		"pinYin": "mǎi dú huán zhū",
		"explain": "椟：木匣；珠：珍珠。买下木匣，退还了珍珠。比喻没有眼力，取舍不当。",
		"source": "《韩非子·外储说左上》：“楚人有卖其珠于郑者，为木兰之柜，熏以桂椒，缀以珠玉，饰以玫瑰，辑以羽翠。郑人买其椟而还其珠。”",
		"example": "不善读书者，昧菁英而矜糟粕。买椟还珠，虽多奚益？改用白话，决无此病。（清·裘廷梁《论白话为维新之本》）",
		"answer": "买椟还珠"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/manfujinglun.png",
		"options": ["蘗", "族", "跎", "腹", "瞒", "纨", "缺", "宕", "希", "蝎", "窃", "满", "帜", "兰", "纶", "古", "经", "鼗", "嶙", "蔡", "计", "谤", "磷", "瀣"],
		"pinYin": "mǎn fù jīng lún",
		"explain": "比喻政治见识和主张。形容人极有才干和智谋。",
		"source": "《易·屯》：“云雷屯，君子以经纶。”",
		"example": "仲老，真佩服，满腹经纶！这果然是奥妙！（茅盾《子夜》二）",
		"answer": "满腹经纶"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/meifeisewu.png",
		"options": ["泷", "溷", "帼", "姣", "沥", "埠", "眉", "觉", "舞", "袍", "壮", "漕", "想", "侵", "宫", "攧", "翘", "飞", "徂", "模", "色", "婴", "妁", "沟"],
		"pinYin": "méi fēi sè wǔ",
		"explain": "色：脸色。形容人得意兴奋的样子。",
		"source": "清·李宝嘉《官场现形记》第三十二回：“余荩臣一听‘明保’二字，正是他心上最为关切之事，不禁眉飞色舞。”",
		"example": "他一定是听见了什么好消息，一副眉飞色舞的样子。",
		"answer": "眉飞色舞"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/meilaiyanqu.png",
		"options": ["讼", "布", "慵", "爇", "眼", "去", "唤", "罗", "眉", "练", "瞰", "恢", "个", "轾", "恙", "来", "苴", "拇", "闾", "泝", "彗", "纶", "柢", "硎"],
		"pinYin": "méi lái yǎn qù",
		"explain": "形容用眉眼传情。",
		"source": "宋·辛弃疾《满江红·赣州席上呈太守陈季陵侍郎》：“落日苍茫，风才定，片帆无力。还记得眉来眼去，水光山色。”",
		"example": "日渐情熟，眉来眼去，情不能已。（明·冯梦龙《警世通言》卷二）",
		"answer": "眉来眼去"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/miaoshouhuichun.png",
		"options": ["绘", "纷", "晏", "采", "琏", "手", "挫", "轩", "倍", "俜", "咋", "震", "春", "寥", "回", "妙", "罇", "鲭", "倖", "堆", "嬉", "杕", "诏", "蒲"],
		"pinYin": "miào shǒu huí chūn",
		"explain": "指医生医术高明。",
		"source": "清·李宝嘉《官场现形记》第二十回：“但是药铺门里门外，足足挂着二三十块匾额：什么‘功同良相’，什么‘扁鹊复生’，什么‘妙手回春’……”",
		"example": "华佗素有妙手回春的称喻。",
		"answer": "妙手回春"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/mudengkoudai.png",
		"options": ["战", "绊", "配", "粱", "覩", "经", "忮", "直", "目", "瞪", "禹", "耋", "呆", "飘", "岿", "撧", "口", "甸", "泽", "斓", "儿", "扑", "摹", "鼓"],
		"pinYin": "mù dèng kǒu dāi",
		"explain": "形容因吃惊或害怕而发愣的样子。",
		"source": "元·无名氏《赚蒯通》第一折：“吓得项王目瞪口呆，动弹不得。”",
		"example": "弟弟看着被打碎的花瓶，吓得目瞪口呆。",
		"answer": "目瞪口呆"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/muzhongwuren.png",
		"options": ["冷", "厥", "沤", "汞", "沦", "须", "目", "玩", "桥", "无", "进", "偕", "匆", "羊", "夏", "斛", "缪", "砑", "乍", "跧", "中", "泆", "人", "啃"],
		"pinYin": "mù zhōng wú rén",
		"explain": "眼里没有别人。形容骄傲自大，看不起人。",
		"source": "明·冯梦龙《东周列国志》第九十六回：“赵奢子赵括，自少喜谈兵法，家传《六韬》、《三略》之书，一览而尽；尝与父奢论兵，指天画地，目中无人，虽奢亦不能难也。”",
		"example": "巴金《秋》：“我对你说，你不要目中无人，就把长辈都不放在眼睛里。”",
		"answer": "目中无人"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/niaoyuhuaxiang.png",
		"options": ["椀", "拥", "堤", "臬", "厢", "煞", "抽", "遝", "蔬", "享", "謷", "扯", "香", "买", "花", "辘", "闺", "同", "馀", "鸟", "跑", "瓶", "语", "胶"],
		"pinYin": "niǎo yǔ huā xiāng",
		"explain": "鸟叫得好听，花开得喷香。形容春天的美好景象。",
		"source": "清·李汝珍《镜花缘》第九十八回：“云雾渐淡，日色微明，四面也有人烟来往，各处花香鸟语，颇可盘桓。”",
		"example": "春天一到，公园里鸟语花香，充满了生机。",
		"answer": "鸟语花香"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/nishuixingzhou.png",
		"options": ["镞", "谋", "悸", "耗", "睛", "俜", "绁", "擐", "蕃", "节", "饧", "柰", "黩", "袋", "舟", "庳", "行", "细", "逆", "饰", "缣", "和", "水", "冀"],
		"pinYin": "nì shuǐ xíng zhōu",
		"explain": "逆着水流的方向行船。比喻不努力就要后退。",
		"source": "鲁迅《且介亭杂文 门外文谈》：“即使目下还有点逆水行舟，也只好拉纤。”",
		"example": "即使目下还有点逆水行舟，也只好拉纤。（鲁迅《且介亭杂文·门外文谈》）",
		"answer": "逆水行舟"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/paishandaohai.png",
		"options": ["呶", "倒", "些", "桔", "柜", "岐", "树", "瘈", "概", "寸", "诰", "啻", "吼", "帘", "山", "敛", "赔", "敝", "麒", "运", "滑", "排", "嘻", "海"],
		"pinYin": "pái shān dǎo hǎi",
		"explain": "推开高山，翻倒大海。形容力量强盛，声势浩大。",
		"source": "《资治通鉴·齐纪高宗建武二年》：“昔世祖以回山倒海之威，步骑数十万，南临瓜步，诸郡尽降。”宋·杨万里《六月二十四日病起喜雨》：“病势初来敌颇强，排山倒海也难当。”",
		"example": "这种排山倒海的巨潮，是任何顽固势力所不能抵挡得住的。（邹韬奋《抗战以来·自动奋发的千万青年》）",
		"answer": "排山倒海"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/pengfudaxiao.png",
		"options": ["笑", "名", "捧", "荟", "腹", "览", "缱", "倸", "钗", "奴", "朱", "大", "然", "象", "迥", "华", "鴃", "稼", "鸣", "翦", "女", "阆", "幌", "雅"],
		"pinYin": "pěng fù dà xiào",
		"explain": "用手捂住肚子大笑。形容遇到极可笑之事，笑得不能抑制。",
		"source": "司马季主捧腹大笑曰：‘观大夫类有道术者，今何言之陋也，何辞之野也！’  西汉·司马迁《史记·日者列传》",
		"example": "听了他讲的笑话，大家都捧腹大笑。",
		"answer": "捧腹大笑"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/pingfenqiuse.png",
		"options": ["讦", "鸳", "巘", "屐", "篲", "墟", "分", "伺", "析", "昏", "色", "僝", "秋", "平", "欺", "跋", "莺", "偾", "撒", "师", "诼", "鲐", "味", "顺"],
		"pinYin": "píng fēn qiū sè",
		"explain": "比喻双方各得一半，不分上下。",
		"source": "《楚辞·九辩》：“皇天平分四时兮，窃独悲此廪秋。”宋·李朴《中秋》诗：“平分秋色一轮满，长伴云衢千里明。”",
		"example": "这场足球赛，两队势均力敌，平分秋色，最后以１：１握手言和。",
		"answer": "平分秋色"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/pomenerru.png",
		"options": ["沦", "嫦", "藉", "喔", "咈", "入", "门", "源", "胾", "痼", "曩", "泽", "借", "糖", "贩", "复", "旃", "囤", "踽", "鲍", "鼬", "破", "而", "桮"],
		"pinYin": "pò mén ér rù",
		"explain": "砸开门进去。多指盗贼行为。",
		"source": "章炳麟《驳革命驳议》：“迨至群盗破门而入，即更不复能抵御。”",
		"example": "无",
		"answer": "破门而入"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/qiangciduoli.png",
		"options": ["泱", "词", "窸", "花", "强", "娓", "隔", "理", "囵", "瞥", "瓞", "谰", "鸷", "沥", "绊", "外", "夥", "锣", "嘿", "陨", "醲", "粃", "夺", "傜"],
		"pinYin": "qiǎng cí duó lǐ",
		"explain": "强词：强辩；夺：争。指无理强辩，明明没理硬说有理。",
		"source": "明·罗贯中《三国演义》第四十三回：“座上一人忽日：‘孔明所言，皆强词夺理，均非正论，不必再言。”",
		"example": "他的话简直就是强词夺理，你不要信他。",
		"answer": "强词夺理"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/qianjunwanma.png",
		"options": ["马", "受", "艴", "绥", "醲", "托", "皋", "匀", "孥", "汾", "鲸", "娴", "欬", "希", "各", "別", "伛", "住", "万", "军", "秋", "千", "戤", "聆"],
		"pinYin": "qiān jūn wàn mǎ",
		"explain": "形容雄壮的队伍或浩大的声势。",
		"source": "《南史·陈庆之传》：“名军大将莫自牢，千兵万马避白袍。”",
		"example": "各方面竟如千军万马地围困拢来，实在说，我是有被这班箭手底乱箭所射死的可能性的。（柔石《二月》二四）",
		"answer": "千军万马"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/qilizisan.png",
		"options": ["散", "掇", "侃", "奶", "乐", "捡", "蓄", "雉", "子", "凤", "闲", "垛", "蓺", "篱", "隽", "庀", "鲂", "菹", "离", "漉", "仑", "币", "也", "妻"],
		"pinYin": "qī lí zǐ sàn",
		"explain": "一家子被迫分离四散。",
		"source": "《孟子·梁惠王上》：“父母冻饿，兄弟妻子离散，”",
		"example": "无辜人民之死伤成千累万，妻离子散啼饥号寒者到处皆是。（毛泽东《评国民党对战争责任问题的几种答案》）",
		"answer": "妻离子散"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/qingyuhongmao.png",
		"options": ["仓", "鹯", "鸿", "恶", "鹞", "蜊", "于", "架", "龌", "劳", "奥", "昙", "稊", "噼", "轻", "匕", "营", "崟", "桷", "州", "阡", "坼", "毛", "舞"],
		"pinYin": "qīng yú hóng máo",
		"explain": "鸿毛：大雁的毛。比大雁的毛还轻。比喻毫无价值。",
		"source": "汉·司马迁《报任少卿书》：“人固有一死，或重于泰山，或轻于鸿毛，用之所趣异也。”",
		"example": "梅伯死轻于鸿毛，有何惜哉？（明·许仲琳《封神演义》第六回）",
		"answer": "轻于鸿毛"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/qishangbaxia.png",
		"options": ["下", "孳", "馗", "陈", "玷", "朦", "筵", "朽", "坏", "罢", "穗", "髯", "坑", "偷", "珞", "上", "繁", "棼", "陂", "孟", "鷇", "瞵", "八", "七"],
		"pinYin": "qī shàng bā xià",
		"explain": "形容心里慌乱不安。",
		"source": "明·施耐庵《水浒全传》第二十六回：“那胡正卿心头十五个吊桶打水，七上八下。”",
		"example": "他就感觉得七上八下，心里老不自在。（沙汀《烦恼》）",
		"answer": "七上八下"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/qishoubajiao.png",
		"options": ["粲", "胝", "嚣", "视", "七", "伴", "嘴", "图", "脚", "牲", "咐", "妆", "瞥", "载", "八", "渚", "已", "啭", "辇", "椎", "奡", "馆", "饯", "手"],
		"pinYin": "qī shǒu bā jiǎo",
		"explain": "形容人多手杂，动作纷乱。",
		"source": "宋·释普济《五灯会元》卷二十：“上堂七手八脚，三头两面，耳听不闻，眼觑不见，苦乐逆顺，打成一片。”",
		"example": "众人七手八脚将他扛抬了出来。（清·吴敬梓《儒林外史》第三回）",
		"answer": "七手八脚"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/renyangmafan.png",
		"options": ["现", "搔", "马", "飡", "人", "蹀", "尔", "仰", "硕", "砠", "噫", "歇", "佑", "头", "绌", "婀", "畸", "砆", "涕", "翻", "刎", "年", "觚", "毗"],
		"pinYin": "rén yǎng mǎ fān",
		"explain": "人马被打得仰翻在地。形容被打得惨败。也比喻乱得一塌糊涂，不可收拾。",
		"source": "清·曹雪芹《红楼梦》第一百十五回：“贾琏家下无人，请了王仁来在外帮着料理。那巧姐儿是日夜哭母，也是病了。所以荣府中又闹得马仰人翻。”",
		"example": "这么晴朗的天气，天空是湛蓝湛蓝的，真不象双方就要杀得人仰马翻！（姚雪垠《李自成》第二卷第二十六章）",
		"answer": "人仰马翻"
	}, 
	{
		"imgSrc": "https://show.ybccode.com/idiom/sanchangliangduan.png",
		"options": ["瞠", "短", "绌", "袋", "纂", "词", "盱", "帛", "三", "为", "胼", "砆", "硕", "貂", "瞬", "头", "救", "粉", "饷", "两", "予", "年", "佑", "长"],
		"pinYin": "sān cháng liǎng duǎn",
		"explain": "指意外的灾祸或事故。特指人的死亡。",
		"source": "明·范文若《鸳鸯棒·恚剔》：“我还怕薄情郎折倒我的女儿，须一路寻上去，万一有三长两短，定要讨个明白。”",
		"example": "要是万一李嫂子有三长两短，真是可惜！（姚雪垠《李自成》第一卷第十七章）",
		"answer": "三长两短"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/sanrenchenghu.png",
		"options": ["卷", "茗", "冷", "虎", "人", "床", "领", "三", "颠", "成", "休", "称", "揑", "扪", "吹", "恻", "偭", "估", "帆", "沫", "素", "怱", "僚", "冰"],
		"pinYin": "sān rén chéng hǔ",
		"explain": "三个人谎报城市里有老虎，听的人就信以为真。比喻说的人多了，就能使人们把谣言当事实。",
		"source": "《战国策·魏策二》：“夫市之无虎明矣，然而三人言而成虎。”",
		"example": "文化大革命中，别有用心的人以讹传讹，三人成虎，致使不少好人受到迫害。",
		"answer": "三人成虎"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/sanxineryi.png",
		"options": ["体", "扎", "亘", "分", "过", "三", "忑", "意", "探", "彬", "舒", "店", "板", "怖", "庀", "穉", "桊", "翩", "庆", "心", "珂", "二", "嚷", "踢"],
		"pinYin": "sān xīn èr yì",
		"explain": "又想这样又想那样，犹豫不定。常指不安心，不专一。",
		"source": "元·关汉卿《救风尘》第一折：“争奈是匪妓，都三心二意。”",
		"example": "可是眼下大敌当前，后有追兵，你可千万不要三心二意，迟疑不决，误了大事。（姚雪垠《李自成》第一卷第四章）",
		"answer": "三心二意"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/shenbukece.png",
		"options": ["憋", "炸", "深", "帜", "捎", "適", "岱", "砍", "问", "不", "测", "欹", "獐", "宏", "逶", "可", "窟", "酉", "改", "聋", "泾", "吊", "晚", "躺"],
		"pinYin": "shēn bù kě cè",
		"explain": "深得无法测量。比喻对事物的情况捉摸不透。",
		"source": "明·袁宏道《吼山》：“山下石骨为匠者搜去，积水为潭，望之洞黑如墨汁，深不可测。”",
		"example": "隆武帝深不可测地微笑。（华而实《汉衣冠》一）",
		"answer": "深不可测"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/shipotianjing.png",
		"options": ["净", "楺", "石", "蒐", "吉", "赃", "破", "琦", "惊", "姿", "天", "咕", "澄", "歌", "抃", "橛", "犒", "絶", "叶", "诨", "疏", "恭", "翼", "纨"],
		"pinYin": "shí pò tiān jīng",
		"explain": "原形容箜篌的声音，忽而高亢，忽而低沉，出人意外，有能以形容的奇境。后多比喻文章议论新奇惊人。",
		"source": "唐·李贺诗《李凭箜篌引》：“女娲炼石补天处，石破天惊逗秋雨。”",
		"example": "陈继泰被他们这样的一来，好似那雷霆乍震，石破天惊，只吓得个肺腑皆崩，神魂出窍。（清·张春帆《宦海》第十九回）",
		"answer": "石破天惊"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/shirupozhu.png",
		"options": ["哧", "捏", "怛", "如", "竹", "巫", "破", "雌", "韶", "谮", "鹘", "狩", "拖", "蜣", "请", "踪", "巡", "籁", "幅", "瞌", "器", "餬", "躯", "势"],
		"pinYin": "shì rú pò zhú",
		"explain": "势：气势，威力。形势就象劈竹子，头上几节破开以后，下面各节顺着刀势就分开了。比喻节节胜利，毫无阻碍。",
		"source": "《晋书·杜预传》：“今兵威已振，譬如破竹，数节之后，皆迎刃而解。”",
		"example": "关胜等众，乘势长驱，势如破竹，又克大谷县。（明·施耐庵《水浒全传》第九十九回）",
		"answer": "势如破竹"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/shuidaoqucheng.png",
		"options": ["和", "搤", "垦", "成", "鹗", "哀", "逅", "衿", "不", "梁", "納", "澭", "孅", "渠", "调", "缟", "侈", "劓", "到", "雏", "福", "水", "盱", "夹"],
		"pinYin": "shuǐ dào qú chéng",
		"explain": "渠：水道。水流到的地方自然形成一条水道。比喻条件成熟，事情自然会成功。",
		"source": "宋·苏轼《答秦太虚书》：“至时别作经画，水到渠成，不须预虑。”",
		"example": "须要自然而然，水到渠成，非由车戽，最忌无因而至，突如其来。（清·李渔《闲情偶寄·大收煞》）",
		"answer": "水到渠成"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/shuiluoshichu.png",
		"options": ["鹓", "托", "遐", "衽", "出", "縻", "穷", "恶", "螂", "司", "橜", "偶", "岛", "猪", "落", "池", "户", "姊", "酌", "绛", "水", "石", "饰", "遄"],
		"pinYin": "shuǐ luò shí chū",
		"explain": "水落下去，水底的石头就露出来。比喻事情的真相完全显露出来。",
		"source": "宋·欧阳修《醉翁亭记》：“野芳发而幽香，佳木秀而繁阴，风霜高洁，水落而石出者，山间之四时也。”宋·苏轼《后赤壁赋》：“山高月小，水落石出。”",
		"example": "水山，不要急。事情早晚能弄个水落石出。（冯德英《迎春花》第二十章）",
		"answer": "水落石出"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/shunshouqiianyang.png",
		"options": ["羊", "禳", "手", "谐", "衅", "忧", "卲", "刼", "木", "瀑", "殍", "坊", "顺", "焮", "角", "岳", "鞠", "斸", "漓", "轧", "踊", "牵", "韶", "炳"],
		"pinYin": "shùn shǒu qiān yáng",
		"explain": "顺手把人家的羊牵走。比喻趁势将敌手捉住或乘机利用别人。现比喻乘机拿走别人的东西。",
		"source": "《礼记·曲礼上》：“效马效羊者右牵之。”",
		"example": "据说座山雕的部下有个顺手牵羊的老方子，一撮毛可能是想施展这个伎俩。（曲波《林海雪原》十二）",
		"answer": "顺手牵羊"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/sipingbawen.png",
		"options": ["姬", "愉", "秤", "游", "威", "冓", "稳", "噫", "叉", "雪", "半", "劾", "溷", "匿", "函", "八", "平", "蟇", "四", "谄", "柄", "开", "笈", "耄"],
		"pinYin": "sì píng bā wěn",
		"explain": "原形容身体各部位匀称、结实。后常形容说话做事稳当。也形容做事只求不出差错，缺乏积极创新精神。",
		"source": "明·施耐庵《水浒全传》第四十四回：“戴宗、杨林看裴宣时，果然好表人物，生得面白肥胖，四平八稳，心中暗喜。”",
		"example": "总而言之，现在倘再发那些四平八稳的“救救孩子”似的议论，连我自己听去，也觉得空空洞洞了。（鲁迅《而已集·答有恒先生》）",
		"answer": "四平八稳"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/tianbengdilie.png",
		"options": ["謇", "乌", "崩", "肃", "厕", "盱", "麤", "榼", "勒", "天", "目", "谫", "膊", "寻", "峨", "裂", "嚓", "工", "嘘", "辫", "地", "继", "癖", "蹉"],
		"pinYin": "tiān bēng dì liè",
		"explain": "象天塌下、地裂开那样。比喻重大的事变。",
		"source": "《战国策·赵策三》：“天崩地坼，天子下席。”",
		"example": "(1)即使天崩地裂也动摇不了他对党对祖国的一颗忠心。(2)只听天崩地裂一声巨响，十几层的高楼霎时夷为平地。",
		"answer": "天崩地裂"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/toutianhuanri.png",
		"options": ["截", "天", "偷", "爪", "坌", "褫", "眄", "痿", "换", "道", "豚", "谮", "蜡", "令", "魃", "恇", "穑", "慧", "伦", "侠", "藜", "日", "袁", "悭"],
		"pinYin": "tōu tiān huàn rì",
		"explain": "比喻暗中改变事物的真相，以达到蒙混欺骗的目的。",
		"source": "清·李宝嘉《官场现形记》第五十三回：“且说尹子崇自从做了这一番偷天换日的大事业，等到银子到手，便把原有的股东一齐写信去招呼。”",
		"example": "他所玩弄的偷天换日的鬼把戏，早被大家识破了。",
		"answer": "偷天换日"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/touzhongjiaoqing.png",
		"options": ["麟", "开", "琥", "笛", "重", "廋", "轻", "馥", "攧", "垣", "臬", "挈", "缾", "紫", "菱", "粒", "膏", "头", "精", "娥", "脚", "句", "轳", "嗥"],
		"pinYin": "tóu zhòng jiǎo qīng",
		"explain": "头脑发胀，脚下无力。形容身体不适。也比喻基础不牢固。",
		"source": "明·天然痴叟《石点头·侯官县烈女歼仇》：“他的酒量原不济，三瓯落肚，渐觉头重脚轻。”",
		"example": "墙上芦苇，头重脚轻要底浅；山间竹笋，嘴尖皮厚腹中空。（毛泽东《改造我们的学习》）",
		"answer": "头重脚轻"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/woxinchangdan.png",
		"options": ["膜", "骧", "谛", "胆", "围", "讹", "骖", "睃", "秦", "螳", "督", "奥", "郊", "卧", "数", "薪", "绕", "鬪", "盹", "睿", "欲", "咶", "榜", "尝"],
		"pinYin": "wò xīn cháng dǎn",
		"explain": "薪：柴草。睡觉睡在柴草上，吃饭睡觉都尝一尝苦胆。形容人刻苦自励，发奋图强。",
		"source": "《史记·越王勾践世家》：“越王勾路反国，乃苦身焦思，置胆于坐，坐卧即仰胆，饮食亦尝胆也。”",
		"example": "中国足球要想冲出亚洲，必须卧薪尝胆，刻苦训练。",
		"answer": "卧薪尝胆"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/wuqiongwujin.png",
		"options": ["确", "箪", "经", "故", "嘱", "揑", "俦", "无", "尽", "窣", "鄙", "箫", "咄", "穷", "胎", "无", "冀", "响", "擗", "收", "房", "巘", "顶", "蚁"],
		"pinYin": "wú qióng wú jìn",
		"explain": "穷：完。没有止境，没有限度。",
		"source": "宋·晏殊《踏莎行》：“无穷无尽是离愁，天涯地角寻思遍。”",
		"example": "那西天路无穷无尽，几时能到得！（明·吴承恩《西游记》第四十回）",
		"answer": "无穷无尽"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/wutitoudi.png",
		"options": ["慨", "窟", "五", "襦", "蜒", "此", "讪", "褚", "俭", "潜", "创", "瘅", "裳", "矛", "欬", "吐", "骧", "虫", "地", "投", "妓", "体", "仙", "杳"],
		"pinYin": "wǔ tǐ tóu dì",
		"explain": "两手、两膝和头一起着地。是佛教一种最恭敬的行礼仪式。比喻佩服到了极点。",
		"source": "唐·玄奘《大唐西域记·三国》：“致敬之式，其仪九等：一、发言慰问，二、俯首示敬，三、举手高揖，四、合掌平拱，五、屈膝，六、长跪，七、手膝踞地，八、五轮俱屈，九、五体投地。”",
		"example": "屡闻至论，本极佩服，今日之说，则更五体投地。（清·刘鹗《老残游记》第六回）",
		"answer": "五体投地"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/xiaolicangdao.png",
		"options": ["营", "七", "消", "僇", "髯", "嗤", "鹏", "描", "厝", "企", "曰", "娱", "里", "永", "宾", "藏", "鲂", "刀", "笑", "洁", "悧", "鲋", "擎", "殻"],
		"pinYin": "xiào lǐ cáng dāo",
		"explain": "形容对人外表和气，却阴险毒辣。",
		"source": "《旧唐书·李义府传》：“义府貌状温恭，与人语必嬉怡微笑，而褊忌阴贼。既处要权，欲人附己，微忤意者，辄加倾陷。故时人言义府笑中有刀。”",
		"example": "他把我丕的来药倒，烟生七窍，冰浸四稍，谁承望笑里藏刀，眼见的丧荒郊。（元·孟汉卿《魔合罗》第二折）",
		"answer": "笑里藏刀"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/xiongyouchengzhu.png",
		"options": ["酰", "软", "呲", "抗", "竹", "成", "琐", "有", "纷", "钉", "喋", "嗽", "坚", "謡", "赁", "似", "拟", "苑", "枫", "壅", "湾", "含", "胸", "瓢"],
		"pinYin": "xiōng yǒu chéng zhú",
		"explain": "原指画竹子要在心里有一幅竹子的形象。后比喻在做事之前已经拿定主意。",
		"source": "宋·苏轼《文与可画筼筜谷偃竹记》：“故画竹，必先得成竹于胸中。”",
		"example": "毛委员胸有成竹，决定马上向南去追赶部队。（陈伯钧《毛主席率领我们上井岗山》）",
		"answer": "胸有成竹"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/xuanyalema.png",
		"options": ["马", "超", "沼", "走", "舒", "踩", "沐", "钿", "酾", "搦", "驴", "淈", "优", "谈", "剔", "诵", "崖", "裋", "勒", "湾", "悬", "鞠", "岩", "炳"],
		"pinYin": "xuán yá lè mǎ",
		"explain": "悬崖：高而陡的山崖；勒马：收住缰绳，使马停步。在高高的山崖边上勒住马。比喻到了危险的边缘及时清醒回头。",
		"source": "清·纪昀《阅微草堂笔记》：“此书生悬崖勒马,可谓大智矣。”",
		"example": "您铸成大错在前，已经对不起天地祖宗，赶快悬崖勒马吧！（华而实《汉衣冠》三）",
		"answer": "悬崖勒马"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/xuekoupenren.png",
		"options": ["覩", "矢", "袪", "帖", "欹", "虹", "序", "僻", "佬", "喷", "人", "航", "厝", "沲", "轫", "壤", "幅", "睢", "牟", "口", "玑", "汩", "惷", "血"],
		"pinYin": "xuè kǒu pēn rén",
		"explain": "比喻用恶毒的话污蔑或辱骂别人。",
		"source": "宋·晓莹《罗湖野录》卷二：“含血喷人，先污其口；百丈野狐，失头狂走。”",
		"example": "她镇静起来，从炕上摸起一件上衣往身上披，用生硬的口吻说：“你别血口喷人！你，你不安好心……”（冯德英《苦菜花》第三章）",
		"answer": "血口喷人"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/yifanfengshun.png",
		"options": ["榭", "猎", "持", "榜", "寳", "元", "峨", "葩", "冻", "昵", "馐", "娥", "柳", "邻", "鹨", "尬", "一", "帆", "顺", "咎", "存", "待", "风", "跛"],
		"pinYin": "yī fán fēng shùn",
		"explain": "船挂着满帆顺风行驶。比喻非常顺利，没有任何阻碍。",
		"source": "唐·孟郊《送崔爽之湖南》：“定知一日帆，使得千里风。”",
		"example": "栉霜沐露多劳顿，喜借得一帆风顺。（清·李渔《怜香伴·蹴居》）",
		"answer": "一帆风顺"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/yijuliangde.png",
		"options": ["鴂", "举", "歔", "一", "挹", "得", "崤", "盔", "舍", "飞", "芙", "咈", "两", "唯", "蜻", "瞌", "聪", "妬", "样", "骏", "灰", "戛", "敛", "慴"],
		"pinYin": "yī jǔ liǎng dé",
		"explain": "做一件事得到两方面的好处。",
		"source": "《晋书·束皙传》：“赐其十年炎复，以慰重迁之情，一举两得，外实内宽。”",
		"example": "一则免楚之患，二则激晋之来，岂非一举两得？（明·冯梦龙《东周列国志》第六十一回）",
		"answer": "一举两得"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/yilushunfeng.png",
		"options": ["系", "忝", "缥", "蠖", "一", "语", "路", "袱", "匍", "趋", "铩", "做", "邵", "憔", "抱", "娉", "瘟", "顺", "椎", "风", "伛", "鹜", "间", "疼"],
		"pinYin": "yī lù shùn fēng",
		"explain": "旅途平安（多用于祝人）。",
		"source": "清 俞万春《荡寇志》第122回：“更喜云陈两处亦无动静，一路顺风无些毫打叉之事。”",
		"example": "我们这次出门旅行真是一路顺风，沿途一点儿也没有耽误。",
		"answer": "一路顺风"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/zhaosanmusi.png",
		"options": ["儆", "屑", "误", "练", "四", "耳", "峙", "勋", "朝", "柴", "凄", "三", "阅", "暮", "挛", "渺", "喙", "伎", "从", "呕", "卑", "文", "毗", "颈"],
		"pinYin": "zhāo sān mù sì",
		"explain": "原指玩弄手法欺骗人。后用来比喻常常变卦，反复无常。",
		"source": "《庄子·齐物论》：“狙公赋芧，曰：‘朝三而暮四。’众狙皆怒。曰：‘然则朝四而暮三。’众狙皆悦。名实未亏而喜怒为用，亦因是也。”",
		"example": "厘定规则：怎样服役，怎样纳粮，怎样磕头，怎样颂圣。而且这规则是不象现在那样朝三暮四的。（鲁迅《坟·灯下漫笔》）",
		"answer": "朝三暮四"
	},
	{
		"imgSrc": "https://show.ybccode.com/idiom/dongshanzaiqi.png",
		"options": ["趋", "舆", "拉", "骈", "翳", "闻", "呪", "奖", "再", "嶂", "傻", "幽", "琨", "水", "山", "剗", "起", "戛", "柳", "东", "澜", "狱", "秩", "亲"],
		"pinYin": "dōng shān zài qǐ",
		"explain": "指再度出任要职。也比喻失势之后又重新得势。",
		"source": "《晋书·谢安传》",
		"example": "要警惕军国主义死灰复燃，东山再起。",
		"answer": "东山再起"
	}
]
//将数组重新排序
// data.sort(function(){ return Math.random() - 0.5})